dgarske/wolfBoot-1/hal/stm32u5xx_hal_conf.h
/* stm32-u5xx_hal_conf.h
 *
 * Copyright (C) 2022 wolfSSL Inc.
 *
 * This file is part of wolfBoot.
 *
 * wolfBoot is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * wolfBoot is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#ifndef __STM32U5xx_HAL_CONF_H
#define __STM32U5xx_HAL_CONF_H

#define HAL_MODULE_ENABLED  
#define HAL_FLASH_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

#include "stm32u5xx_hal_flash.h"
#include "stm32u5xx_hal_rcc.h"
#define assert_param(expr) ((void)0U)

#endif /* __STM32U5xx_HAL_CONF_H */
